cukkuboo-php/app/Models/NotificationModel.php

public function hasUnreadNotifications($userId)
{
    return $this->where('user_id', $userId)
                ->where('status', 1) // 1 = unread
                ->countAllResults() > 0;
---
SELECT COUNT(*) AS `numrows`
FROM `notification`
WHERE `user_id` = '29'
AND `status` = 1