cukkuboo-php/app/Models/SubscriptionPlanModel.php

INSERT INTO `subscriptionplan` (`plan_name`, `price`, `discount_price`, `period`, `features`, `status`, `stripe_price_id`, `modify_on`, `modify_by`, `created_on`, `created_by`) VALUES ('Every 6 Month plan', 23, 2, 50, 'Lorem ipsum', 1, 'price_1RrD59AO6Wc6MO0E4N7PbQLL', '2025-08-01 07:11:42', '29', '2025-08-01 07:11:42', '29')
---
    public function addPlan($data)
    {
        return $this->insert($data);

SELECT *
FROM `subscriptionplan`
WHERE `subscriptionplan`.`subscriptionplan_id` = 76
---
    public function getPlanById($id)
    {
        return $this->find($id);