cukkuboo-php/app/Models/UserModel.php

    public function findUserByToken($token)
    {
        return $this->where('jwt_token', $token)->first();
---
SELECT *
FROM `user`
WHERE `jwt_token` = 'eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJpYXQiOjE3NTQwMzEyNjIsImV4cCI6MTc1NDAzNDg2MiwiZGF0YSI6eyJ1c2VyX2lkIjoiMjkifX0.pUh-o3H0RYXvI2omtkUc8WiboRv4bJ8tZ1ZbeTBspaI'
 LIMIT 1

public function updateSubscriptionStatus($userId, $status)
{
    return $this->update($userId, ['subscription' => $status]);
---
UPDATE `user` SET `subscription` = 'Expired'
WHERE `user`.`user_id` IN ('29')