cukkuboo-php/app/Controllers/Login.php

        'end_date'  => $sub['end_date']
    ]);
    }
    $subscription = $usersubModel
        ->select('user_subscription.*, subscriptionplan.plan_name')
        ->join('subscriptionplan', 'subscriptionplan.subscriptionplan_id = user_subscription.subscriptionplan_id')
        ->where('user_id', $user['user_id'])
        ->where('user_subscription.status !=', 9)
        ->orderBy('user_subscription_id', 'DESC')
        ->first();
---
SELECT `user_subscription`.*, `subscriptionplan`.`plan_name`
FROM `user_subscription`
JOIN `subscriptionplan` ON `subscriptionplan`.`subscriptionplan_id` = `user_subscription`.`subscriptionplan_id`
WHERE `user_id` = '29'
AND `user_subscription`.`status` != 9
ORDER BY `user_subscription_id` DESC
 LIMIT 1


    // Login Type 1: No fcm_token→ just return existing token, no update
    if (empty($data['fcm_token'])) {
    $this->loginModel->update($user['user_id'], $updateData);
---
UPDATE `user` SET `jwt_token` = 'eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJpYXQiOjE3NTQwMTg2MzIsImV4cCI6MTc1NDAyMjIzMiwiZGF0YSI6eyJ1c2VyX2lkIjoiMjkifX0.irkG0aZ_XGpW3ZmJZiBQTrc_hsqf55Bk-O8jsIktnT4', `last_login` = '2025-08-01 03:23:52', `updated_at` = '2025-08-01 03:23:52'
WHERE `user`.`user_id` IN ('29')