cukkuboo-php/app/Controllers/Usersub.php

    }

    if ($existing) {
        $this->usersubModel->update($existing['user_subscription_id'], $payload);
---
UPDATE `user` SET `subscription` = 'Premium'
WHERE `user`.`user_id` IN ('29')

        $payload['user_subscription_id'] = $id;
        $msg = 'Subscription added successfully.';
    }
    $this->userModel->update($userId, ['subscription' => 'Premium']);
---
UPDATE `user` SET `subscription` = 'Premium'
WHERE `user`.`user_id` IN ('29')